[
{"Article URL": "https://www.livemint.com/news/india/developing-taxonomy-for-climate-finance-will-put-indian-standards-on-a-global-platform-ajay-seth-11721901405069.html", "Title": "‘Taxonomy for climate finance will put Indian standards on a global platform’", "Author Name": "Rhik Kundu", "Author URL": "https://www.livemint.com/authors/rhik-kundu", "Article Content": "New Delhi: India's plans to develop a taxonomy for classifying climate finance will bring relevant and appropriate agendas to the forefront while presenting Indian standards globally, according to Ajay Seth, secretary of the finance ministry's department of economic affairs. \n     \n      In a wide ranging interview with Mint, Seth outlined the government's thinking and plans on developing the climate finance taxonomy, improving India's sovereign credit ratings, recalibrating the infrastructure financing framework, and simplifying overseas investment routes for foreign investors. \n     \n      “We are a country with a high population-per capita income, and if we are compared with a country with a smaller population and a higher per capita of over $50,000, climate finance interactive dynamics will be different for us as compared to what it is for them,\" Seth said, adding that the planned standards for classifying climate finance will address such issues. \n     \n      “When we talk about standards, disclosures will have to be made. It is not just the investment-related issues, but also usage-related issues have to be addressed, and decisions will have to be provided,\" Seth added. \n     \n      In her budget speech on Tuesday, finance minister Nirmala Sitharaman said India will develop a taxonomy for climate finance to enhance the availability of capital for climate adaptation and mitigation, which will support the achievement of the country's climate commitments and green transition. \n     \n      The climate finance taxonomy will identify the assets, activities and projects needed to deliver a low-carbon economy consistent with the goals of the Paris Agreement, which are mitigation, adaptation and finance commitments to reach the climate goals. \n     \n       On sovereign credit ratings, Seth said the government is in regular conversation with credit rating agencies to convince them for better ratings on the back of the strength of the Indian economy. \n     \n      India has maintained that its economic health has improved considerably since the pandemic, and finance ministry officials have met rating agency officials to press for an upgrade. \n     \n      A sovereign credit rating measures a government’s ability to repay its debt. A higher rating indicates greater trust in the ability to repay and, consequently, lower borrowing costs. \n     \n      While S&P and Fitch rate India at BBB-, Moody’s rates the South Asian country at Baa3, which indicate the lowest possible investment grade. \n     \n       However, in May, S&P Global sparked hopes for a long-awaited sovereign ratings upgrade for India, raising its country outlook to positive from stable after 14 years. \n     \n      “The next stage is the ratings upgrade, but coming back to bring the debt to a more sustainable level, we intend to have enough focus, enough space so that if another crisis of the proportion which we saw four years ago (coronavirus pandemic) were to come forward, there should be space available for fiscal policy to respond. Overall, the goal is to bring the total debt to a more sustainable level,\" Seth said. \n     \n      “The idea is to let the economy grow at a fast pace and an inclusive manner for a long time. So, the need for investment will be more. We have the potential to sustain high debt for the longer term, but not at the current level of 56%,\" he added. \n     \n      The central government's debt stood at just over 56% of GDP at the end of FY24, lower than 57.1% at the end of March 2023.  \n     \n       Meanwhile, a committee on infrastructure financing headed by Bibek Debroy, chairman of the PM-EAC (Prime Minister's economic advisory council), in which Ajay Seth is a member, has undertaken a comprehensive assessment of the characteristics and parameters defining the infrastructure financing framework. \n     \n      The committee is preparing a framework for infrastructure financing under both public and private financing setups and broad approaches for various sectors, Seth said. \n     \n      “The committee is looking at financing different sectors like roads, railways and ports. What should be our approach for public versus private financing? How can the private sector be incentivised to invest?\" Seth said. \n     \n      The Debroy-led expert committee has had a series of stakeholder consultations and is finalising its recommendations. The committee's final report is expected this year. \n     \n       Seth also said that an easing of overseas investment rules is expected in the coming three months to ease investment norms for foreign portfolio investors (FPIs) and overseas arms of Indian companies. \n     \n      “Most sectors are already under the automatic route and opened up to FDI (foreign direct investment) to the extent of 100%. But there are a whole lot of regulations on how inflow of capital gets regulated under FEMA (foreign exchange management act). There are rules and regulations we intend to simplify so that it becomes easier to invest,\" Seth said. \n     \n      “While measures are under discussion with the RBI and Sebi, common grounds have been found. We expect, over the next three months, these would come out in the open. These changes on rules would be notified by the government while the regulators would make required changes in regulations,\" he added. \n     \n      At present, FPIs are allowed to hold up to 10% of stocks in an Indian company, and any increase in shareholding beyond this level either has to be diluted in a time-bound manner or such investors have to apply afresh as a foreign direct investor, complying with another set of rules and regulations. \n     \n      Similarly, currently norms don’t exist for classification of investment that an overseas company of an Indian entity wishes to make in India without any linkages with the parent. \n     \n        \n     \n        Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Start Investing in Stocks, Mutual Funds, IPOs, and more \n                I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             Start Investing in Stocks, Mutual Funds, IPOs, and more Enter OTP \n               I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             The team will get in touch with you shortly", "Published Date": " 07:00 AM\n            IST"},
{"Article URL": "https://www.livemint.com/companies/news/social-media-influencers-sebi-finfluencers-youtube-x-instagram-hdfc-bank-bfsi-kotak-mahindra-11721644064301.html", "Title": "Private banks collaborate with social media influencers, but with caution", "Author Name": "Pratishtha Bagai", "Author URL": "https://www.livemint.com/authors/pratishtha-bagai", "Article Content": "Mumbai: India’s private banks are collaborating with influencers on social media to promote and establish their products. However, they are doing so cautiously and taking all possible self-regulatory measures after the Securities and Exchange Board of India (Sebi) cracked down on financial influencers. \n     \n      HDFC Bank, India’s largest private sector lender, launched its flagship products, including the Millennia Credit Card, Pixel Credit Card and PayZapp app, using creators to run social media campaigns to attract young, “digital natives.\" \n     \n      The bank also has its own set of influencers, Vigil Aunty and FJ Moneysha, to raise awareness about financial fraud, positioning the brand as responsible. “Our efforts in influencer marketing extend beyond product promotion, working with influencers for financial education and particularly for fraud awareness,\" the bank’s chief marketing officer Ravi Santhanam told   in an emailed statement. \n     \n       The booming creator economy, poised to grow by 25% this year to   2,344 crore, is being leveraged by Indian private banks. An EY marketer’s survey shows that 33% of marketers from the BFSI (banking, financial services and insurance) sector would increase their influencer marketing budget by 10%. \n     \n      However, while working with influencers, banks take all necessary measures to avoid any trouble, keeping the regulator’s watchful eye in mind. They carefully pick creators with whom they would like to work and fully participate in the content creation process, ensuring the creator is aware of the gravity of the situation and does not violate regulatory lines. \n     \n      Last month, Sebi banned regulated entities from associating with financial influencers not registered with the market regulator. Financial influencers—or finfluencers—are individuals who influence investment decisions by creating content on social media platforms like YouTube, X or Instagram. The decision was meant to ensure investors were not misled into believing the high returns that many finfluencers boasted about. \n     \n       “As a regulated entity, we are guided by industry regulations, self-regulatory guidelines and internal policies to ensure transparency, authenticity and integrity in our influencer marketing partnerships... We evaluate association with these influencers using metrics such as reach, engagement and potential views, in addition to a thorough background check,\" Rohit Bhasin, chief marketing officer, Kotak Mahindra Bank, told  . \n     \n      An emailed query sent to the Reserve Bank of India (RBI) on whether the central bank is developing any regulatory framework for the banking sector collaborating with creators remained unanswered till press time. \n     \n      The banks have also been very particular about only working with creators to promote their consumer-facing products and avoid any influencer-related content on the investment front. \n     \n      “We partner with influencers to reach out to our target audience with a range of banking products, from credit and debit cards, asset products and business banking solutions to savings accounts. This naturally excludes the ‘investment’ products where we do not work with influencers,\" Bhasin added. \n     \n      Varsha Shukla, a comedy content creator with 280,000 followers on Instagram and 516,000 subscribers on her and her husband’s YouTube channel, shared her experience collaborating with Federal Bank. “To my surprise, they had already planned the content and a rough outline of a light, couple-comedy script keeping our genre in mind. We were also properly briefed about the legality and regulatory compliances of this project, easing our initial hesitation of working with a bank for the first time and making the overall process very smooth.\" \n     \n       Federal Bank is very particular about targeting the right audience and picking influencers with relatable content. For instance, travel credit cards are marketed by content creators only. This upholds the bank’s authenticity and reputation. “We always look for PPA, that is, product, persona and audience fit…Our influencers are briefed to speak on what is approved on a product, and refrain from speculative pitches,\" M.V.S. Murthy, chief marketing officer of Federal Bank, said1. \n     \n      “In most of the non-regulated industries, it’s mostly  , meaning that the buyer has to beware. In financial services, consumer protection becomes the primary role of the regulator…The regulator is looking towards a comprehensive response to misleading campaigns while there is also a Digital India Bill coming in,\" said Shashwat Sharma, partner, financial services, at consulting firm Kearney. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Start Investing in Stocks, Mutual Funds, IPOs, and more \n                I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             Start Investing in Stocks, Mutual Funds, IPOs, and more Enter OTP \n               I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             The team will get in touch with you shortly", "Published Date": " 06:40 AM\n            IST"},
{"Article URL": "https://www.livemint.com/news/india/iocl-hpcl-bpcl-gail-may-negotiate-jointly-for-crude-oil-lng-gas-11721991268376.html", "Title": "Energy firms plan joint hunt for foreign supplies", "Author Name": "Rituraj Baruah", "Author URL": "https://www.livemint.com/authors/rituraj-baruah", "Article Content": "India's state-run companies scouting the globe for long-term energy supplies are waking up to the power of joint negotiation. \n     \n      Public sector oil refiners will increasingly team up to negotiate oil and gas supplies from abroad, two people aware of the plans said, in a departure from the existing practice of negotiating separately. The joint negotiations are expected to improve their bargaining power, and ensure that they don't compete against each other for the same contracts and drive up prices. \n     \n      “The requirement for supplies should be looked at as that for the Indian market as a whole. Prices, discounts and other preferential terms are expected to be the same for all the public sector companies; only the quantum would differ. The government is encouraging this trend of holding joint negotiations by the Indian companies,\" said one of the two people mentioned above, both of whom spoke on condition of anonymity. \n     \n       The energy companies would sign separate contracts with the supplier, but the terms of the deals are expected to be same. \n     \n      Queries mailed to Indian Oil Corp. Ltd, Bharat Petroleum Corp. Ltd, Hindustan Petroleum Corp. Ltd, GAIL and the petroleum ministry remained unanswered till press time. \n     \n       There has already been a step in this direction: On 5 July, Mint reported that Indian Oil Corp. Ltd (IOCL), Hindustan Petroleum Corp. Ltd (HPCL) and Bharat Petroleum Corp. Ltd (BPCL) are jointly negotiating with Brazil's Petroleo Brasileiro SA (Petrobras) for long-term crude oil supplies. Going ahead, such negotiations will be the norm. \n     \n      Prashant Vasisht, senior vice-president and co-group head of corporate ratings, ICRA Ltd said: “India is a large consumer of oil and gas and has a major say in the market. If Indian companies come together for long-term contracts, it would add more heft to the talks. So, far this has not been a common practice and everybody has been scouting for term contracts individually. Whenever these companies come together, they would have much more bargaining power in negotiating a deal.\" \n     \n       He further said that in the case of oil, companies may be able to get better deals on credit and discounts as in the case of Russian oil, and in the case of liquefied natural gas (LNG), they may be able to sweeten the pricing formula. \n     \n      In May, Union petroleum minister Hardeep Singh Puri had told reporters that domestic oil marketing companies should come together to negotiate long-term contracts. \n     \n      On 19 May, Mint reported that with discounts on Russian crude oil dwindling, India has assembled state-owned and private oil refiners to jointly negotiate for higher discounts and better terms with Russian suppliers, including Russia’s largest oil company Rosneft PJSC. \n     \n      India is the third largest importer of oil and gas and imports about 85% of its energy requirement. In FY24, it imported 233.1 million metric tonne (mmt) of crude oil, compared to 232.7 mmt in the previous fiscal (FY23) \n     \n      India's LNG imports in FY24 were 31,795 million metric standard cubic metre (mmscm), 17.5% higher than 26,304 mmscm in the previous fiscal. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Start Investing in Stocks, Mutual Funds, IPOs, and more \n                I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             Start Investing in Stocks, Mutual Funds, IPOs, and more Enter OTP \n               I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             The team will get in touch with you shortly", "Published Date": " 06:30 AM\n            IST"},
{"Article URL": "https://www.livemint.com/science/news/nasa-images-photo-of-massive-star-clusters-in-milky-way-s-heart-netizens-says-time-travel-in-picture-11721965588690.html", "Title": "NASA images: Photo of massive star clusters in Milky Way’s heart; netizens say ‘time travel in picture’", "Author Name": "Karishma Pranav Bhavsar", "Author URL": "https://www.livemint.comhttps://www.livemint.com/authors/karishma-pranav-bhavsar", "Article Content": "The National Aeronautics and Space Administration (NASA) has shared stunning image of center of the galaxy which showcases massive star cluster containing more than half a million stars. As per NASA, these stars are part of a massive nuclear star cluster clumped around a central supermassive black hole about 4 million times the mass of our Sun. The , ESA and The Hubble Heritage Team. The Hubble Space Telescope which launched in 1990 changed the   of the universe right from determining the atmospheric composition of planets around other stars to discovering dark energy. Coming back to the image shared by NASA Hubble, it explained that the “snowstorm\" of stars in the image shared is just the tip of the iceberg as astronomers estimate that around 10 million stars in this cluster are too faint to be visible in the image. took to social media and shared the mesmerising image of the galaxy. It wrote, “Journey to the center of our galaxy. Deep in the heart of our Milky Way galaxy lies a massive star cluster containing more than half a million stars. Hubble’s infrared view stitched a 50-light-year span of stars together to create this #HubbleClassic\" Netizens have expressed their amazement at the image shared by NASA Hubble, with some describing it as “Time travel in a picture\" and others calling it “Beautifully wow\", “Stunning,\" and “Stellar\" Many users have also thanked NASA for the valuable insights, imagery, and research. “Thanks for providing us all the insight, imagery and the research,\" a user wrote. “There is definitely alot of other life out there. Way to many places and chances for that not to be true,\" some other added. Already more than a  , two NASA astronauts will remain at the International Space Station until engineers finish working on problems plaguing their Boeing capsule. Test pilots Butch Wilmore and Sunita Williams were supposed to visit the orbiting lab for about a week and return in mid-June, but thruster failures and helium leaks on Boeing's new Starliner capsule prompted NASA and Boeing to keep them up longer. NASA’s commercial crew program manager Steve Stich said mission managers are not ready to announce a return date.     \nLivemint tops charts as the fastest growing news website in the world      to know more.\n  3.6 Crore Indians visited in a single day choosing us as India's undisputed platform for General Election Results. Explore the latest updates   \n Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Start Investing in Stocks, Mutual Funds, IPOs, and more \n                I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             Start Investing in Stocks, Mutual Funds, IPOs, and more Enter OTP \n               I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             The team will get in touch with you shortly", "Published Date": "10:12 AM IST"},
{"Article URL": "https://www.livemint.com/science/news/paris-olympic-2024-what-if-athletes-competed-in-space-watch-this-nasa-video-featuring-sunita-williams-to-know-11722060538689.html", "Title": "Paris Olympics 2024: What if athletes competed in space? Watch this NASA video, featuring Sunita Williams, to know", "Author Name": "Livemint", "Author URL": "https://www.livemint.comhttps://www.livemint.com/authors/livemint", "Article Content": "As the Paris Olympics 2024 kicked off on Friday with a huge pomp and show, the National Aeronautics and Space Administration (NASA) shared an interesting video of astronauts “pretending to be athletes\" in space. The nearly two-minute video featuring Indian-origin astronaut Sunita Williams showed astronauts practising their favourite sport inside the International Space Station (ISS). The video, beginning with heroic background music, features several ISS astronauts holding an Olympic torch prop individually. Later, all of them can be seen doing warm-ups to practise separate sports inside the space station, like sprinting, weight lifting, aerobatics, etc. At the end, one of the astronauts concluded the video by sharing the team's experience of practising as “athletes in space\". He also added that it is comparatively easier to perform weightlifting and other physical activities because of weightlessness. “We had the benefit of weightlessness. We can't imagine how hard this must be to be a world-class athlete under actual gravity. So from all of us aboard the International Space Station (ISS), to every single athlete in the Olympic games, God Speed,\" said a NASA astronaut in the video. More than 6,000 athletes will participate in the Summer Olympics, which began on Friday in Paris. The opening ceremony was held in the city, and thousands of athletes sailed in the Seine River. The spectacle started with a dreamy break from tradition as 'Parade of Nations' kicked off the proceedings in which athletes from 205 countries and one refugee team sailed down the Seine on boats despite heavy rain, in the run-up to and during the ceremony, threatening to play spoilsport. French President Emmanuel Macron declared the Games open, marking the formal beginning of competitions for the next 16 days. The highlight of the unconventional and daring opening ceremony was without doubt the athletes' march on the Seine river.   \nLivemint tops charts as the fastest growing news website in the world      to know more.\n  3.6 Crore Indians visited in a single day choosing us as India's undisputed platform for General Election Results. Explore the latest updates   \n Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp Start Investing in Stocks, Mutual Funds, IPOs, and more \n                I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             Start Investing in Stocks, Mutual Funds, IPOs, and more Enter OTP \n               I'm interested in opening a Trading and Demat Account and am comfortable with the online account opening process. I'm open to receiving promotional messages through various channels, including calls, emails & SMS.\n             The team will get in touch with you shortly", "Published Date": "12:19 PM IST"}
]